# Реализуйте программу, которая будет эмулировать работу с пространствами имен.
# Необходимо реализовать поддержку создания пространств имен и добавление в них переменных.
#
# В данной задаче у каждого пространства имен есть уникальный текстовый идентификатор – его имя.
#
# Вашей программе на вход подаются следующие запросы:
#
#     create <namespace> <parent> –  создать новое пространство имен с именем <namespace> внутри пространства <parent>
#     add <namespace> <var> – добавить в пространство <namespace> переменную <var>
#     get <namespace> <var> – получить имя пространства, из которого будет взята переменная <var> при запросе
#     из пространства <namespace>, или None, если такого пространства не существует
#
# Рассмотрим набор запросов
#
#     add global a
#     create foo global
#     add foo b
#     create bar foo
#     add bar a
#
# Структура пространств имен описанная данными запросами будет эквивалентна структуре пространств имен,
# созданной при выполнении данного кода
#
# a = 0
# def foo():
#   b = 1
#   def bar():
#     a = 2
#
# В основном теле программы мы объявляем переменную a, тем самым добавляя ее в пространство global.
# Далее мы объявляем функцию foo, что влечет за собой создание локального для нее пространства имен
# внутри пространства global. В нашем случае, это описывается командой create foo global.
# Далее мы объявляем внутри функции foo функцию bar, тем самым создавая
# пространство bar внутри пространства foo, и добавляем в bar переменную a.
#
# Добавим запросы get к нашим запросам
#
#     get foo a
#     get foo c
#     get bar a
#     get bar b
#
# Представим как это могло бы выглядеть в коде
#
# a = 0
# def foo():
#   b = 1
#   get(a)
#   get(c)
#   def bar():
#     a = 2
#     get(a)
#     get(b)
#
# Результатом запроса get будет имя пространства, из которого будет взята нужная переменная.
# Например, результатом запроса get foo a будет global, потому что в пространстве foo не объявлена переменная a,
# но в пространстве global, внутри которого находится пространство foo, она объявлена. Аналогично,
# результатом запроса get bar b будет являться foo, а результатом работы get bar a будет являться bar.
#
# Результатом get foo c будет являться None, потому что ни в пространстве foo,
# ни в его внешнем пространстве global не была объявлена переменная с.
#
# Более формально, результатом работы get <namespace> <var> является
#
#     <namespace>, если в пространстве <namespace> была объявлена переменная <var>
#     get <parent> <var> – результат запроса к пространству, внутри которого было создано пространство <namespace>,
#     если переменная не была объявлена
#     None, если не существует <parent>, т. е. <namespace>﻿ – это global
#
# Формат входных данных
#
# В первой строке дано число n (1 ≤ n ≤ 100) – число запросов.
# В каждой из следующих n строк дано по одному запросу.
# Запросы выполняются в порядке, в котором они даны во входных данных.
# Имена пространства имен и имена переменных представляют из себя строки длины не более 10,
# состоящие из строчных латинских букв.
# Формат выходных данных
#
# Для каждого запроса get выведите в отдельной строке его результат.
#
#
# Sample Input:
#
# 9
# add global a
# create foo global
# add foo b
# get foo a
# get foo c
# create bar foo
# add bar a
# get bar a
# get bar b
#
# Sample Output:
#
# global
# None
# bar
# foo
#
dict = {'global': ['None']}


def get(name, var):
    if var in dict.get(name):
        print(name)
    elif dict[name][0] != 'None':
        get(dict[name][0], var)
    else:
        print('None')


for _ in range(int(input())):
    act, namespace, var = input().split()
    if act == 'add':
        dict[namespace].append(var)
    elif act == 'get':
        get(namespace, var)
    else:
        dict[namespace] = [var]


# Пример решения. Будем храним две структуры:
# 1) Кто чей родитель
# 2) Переменные объявленные в данном пространстве имён
#
# Если команда create -- создаём новое пространство имён (запоминаем родителя и создаём пустое множество переменных, объявленных в этом пространстве имен).
#
# Если команда add -- то просто помещаем имя переменной в соответствующее множество.
#
# Если команда get -- то проверяем наличие данной переменной в нашем пространстве имён, если не нашли: проверяем в родителе. Если не нашли в родителе, проверяем в родителе родителя и так далее. Как только нашли имя переменной -- вывели на экран пространство имён, в котором нашли. Если в процессе поиска мы имя не нашли (fst is None) -- выводим None на экран.
#
# n = int(input())
#
# parent = {"global": None}
# vs = {"global": set()}
#
# for _ in range(n):
#     t, fst, snd = input().split()
#     if t == "create":
#         parent[fst] = snd
#         vs[fst] = set()
#     elif t == "add":
#         vs[fst].add(snd)
#     else:  # t == get
#         while fst is not None:
#             if snd in vs[fst]:
#                 break
#             fst = parent[fst]
#         print(fst)
#


# Оценки
# сложности
# одного
# и
# тогоже
# кода
# немного
# меняются
# со
# временем, поэтому
# не
# знаю, на
# сколько
# это
# может
# быть
# полезно.Но
# на
# всякий
# случай
# оставляю
# этот
# вариант
#
# info = dict({'global': [None]})
#
#
# def create(namespace, parent):
#     info.update({namespace: [parent]})
#
#
# def add(namespace, var):
#     info[namespace].append(var)
#
#
# def get(namespace, var):
#     while namespace != None and var not in info[namespace][1:]:
#         namespace = info[namespace][0]
#     print(namespace)
#
#
# operations = {'create': create, 'add': add, 'get': get}
# for i in range(int(input())):
#     inp = input().split()
#     operations[inp[0]](inp[1], inp[2])


# dct={'global':['None']}                                             # словарь списков(родитель,переменные)
# for ops, nms, v in [input().split() for i in range(int(input()))]:  # цикл операций(копипаст у Vladmir Ryabov)
#     if   ops=='create':dct[nms]=[v]                                 # создать пространство-новый список в словаре
#     elif ops=='add'   :dct[nms].append(v)                           # новая переменная-добавить в список
#     elif ops=='get':                                                # поиск переменной (циклом)
#         while nms!='None' and v not in dct[nms]:                    # если нет в пространстве-меняем на родителя(пока не None)
#             nms=dct[nms][0]
#         print(nms)

